zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_cortex.c
#ifdef CORE_CM0PLUS
  /* Cortex-M0+ case */
  /* Get priority for Cortex-M system or device specific interrupts */
  /* from appropriate NVIC register, when no "Priority Grouping" is implemented. */
  *pPreemptPriority = NVIC_GetPriority(IRQn);
  *pSubPriority = 0;
#endif /* CORE_CM0PLUS */
#ifdef CORE_CM33
  /* Cortex-M33 case */
  /* Get priority for Cortex-M system or device specific interrupts  */
  /* from appropriate NVIC register according to "Priority Grouping" */
  /* internal setting */
  /* as components "Group Priority" and "SubPriority" specified */
  /* in ARM reference documents */
  NVIC_DecodePriority(NVIC_GetPriority(IRQn), PriorityGroup, pPreemptPriority, pSubPriority);
#endif /* CORE_CM33 */
}

/**
  * @brief  Set Pending bit of an external interrupt.
  * @param  IRQn External interrupt number
  *         This parameter can be an enumerator of IRQn_Type enumeration
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate CMSIS device file
  *         (stm32mp2xxxx.h))
  * @retval None
  */
void HAL_NVIC_SetPendingIRQ(IRQn_Type IRQn)
{
  /* Check input parameter */
  assert_param(IS_NVIC_IRQN_TYPE(IRQn));

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* For Cortex-M with Security Extension case in secure state, */
  /* Get interrupt target state (CMSIS function NVIC_GetTargetState) */
  /* - when interrupt is non-secure */
  if (NVIC_NONSECURE_INTERRUPT == NVIC_GetTargetState(IRQn))
  {
    /*   Set corresponding bit "SETPEND" in corresponding NVIC_ISPR<i>_NS register */
    /*   by using appropriate CMSIS function TZ_NVIC_<x>IRQ_NS */
    TZ_NVIC_SetPendingIRQ_NS(IRQn);
  }
  /* - when interrupt is secure */
  else
  {
    /*   Set corresponding bit "SETPEND" in corresponding NVIC_ISPR<i> register */
    /*   by using appropriate CMSIS function NVIC_<x>IRQ */
    NVIC_SetPendingIRQ(IRQn);
  }
#else
  /* Cortex-M with Security Extension case in non-secure state */
  /* and Cortex-M without Security Extension */
  /* Set corresponding bit "SETPEND" in corresponding NVIC_ISPR<i> register */
  /* by using appropriate CMSIS function NVIC_<x>IRQ */
  NVIC_SetPendingIRQ(IRQn);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
}

/**
  * @brief  Get Pending Interrupt (read the pending register in the NVIC
  *         and return the pending bit for the specified interrupt).
  * @param  IRQn External interrupt number.
  *          This parameter can be an enumerator of IRQn_Type enumeration
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate CMSIS device file
  *         (stm32mp2xxxx.h))
  * @retval status: - 0  Interrupt status is not pending.
  *                 - 1  Interrupt status is pending.
  */
uint32_t HAL_NVIC_GetPendingIRQ(IRQn_Type IRQn)
{
  uint32_t pending_irq_status;

  /* Check input parameter */
  assert_param(IS_NVIC_IRQN_TYPE(IRQn));

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* For Cortex-M with Security Extension case in secure state, */
  /* Get interrupt target state (CMSIS function NVIC_GetTargetState) */
  /* - when interrupt is non-secure */
  if (NVIC_NONSECURE_INTERRUPT == NVIC_GetTargetState(IRQn))
  {
    /*   Read corresponding bit "SETPEND" in corresponding NVIC_ISPR<i>_NS register */
    /*   (or corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i>_NS register) */
    /*   by using appropriate CMSIS function TZ_NVIC_<x>IRQ_NS */
    pending_irq_status = TZ_NVIC_GetPendingIRQ_NS(IRQn);
  }
  /* - when interrupt is secure */
  else
  {
    /*   Read corresponding bit "SETPEND" in corresponding NVIC_ISPR<i> register */
    /*   (or corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i> register) */
    /*   by using appropriate CMSIS function NVIC_<x>IRQ */
    pending_irq_status = NVIC_GetPendingIRQ(IRQn);
  }
#else
  /* Cortex-M with Security Extension case in non-secure state */
  /* and Cortex-M without Security Extension */
  /* Read corresponding bit "SETPEND" in corresponding NVIC_ISPR<i> register */
  /* (or corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i> register) */
  /* by using appropriate CMSIS function NVIC_<x>IRQ */
  pending_irq_status = NVIC_GetPendingIRQ(IRQn);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
  return pending_irq_status;
}

/**
  * @brief  Clear the pending bit of an external interrupt.
  * @param  IRQn External interrupt number.
  *         This parameter can be an enumerator of IRQn_Type enumeration
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate CMSIS device file
  *         (stm32mp2xxxx.h))
  * @retval None
  */
void HAL_NVIC_ClearPendingIRQ(IRQn_Type IRQn)
{
  /* Check input parameter */
  assert_param(IS_NVIC_IRQN_TYPE(IRQn));

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  /* For Cortex-M with Security Extension case in secure state, */
  /* Get interrupt target state (CMSIS function NVIC_GetTargetState) */
  /* - when interrupt is non-secure */
  if (NVIC_NONSECURE_INTERRUPT == NVIC_GetTargetState(IRQn))
  {
    /*   Set corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i>_NS register */
    /*   by using appropriate CMSIS function TZ_NVIC_<x>IRQ_NS */
    TZ_NVIC_ClearPendingIRQ_NS(IRQn);
  }
  /* - when interrupt is secure */
  else
  {
    /*   Set corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i> register */
    /*   by using appropriate CMSIS function NVIC_<x>IRQ */
    NVIC_ClearPendingIRQ(IRQn);
  }
#else
  /* Cortex-M with Security Extension case in non-secure state */
  /* and Cortex-M without Security Extension */
  /* Set corresponding bit "CLRPEND" in corresponding NVIC_ICPR<i> register */
  /* by using appropriate CMSIS function NVIC_<x>IRQ */
  NVIC_ClearPendingIRQ(IRQn);
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */
}

#ifdef CORE_CM33
/**
  * @brief Get active interrupt (read the active register in NVIC and return the active bit).
  * @param IRQn External interrupt number
  *         This parameter can be an enumerator of IRQn_Type enumeration
  *         (For the complete STM32 Devices IRQ Channels list, please refer to the appropriate CMSIS device file
  *         (stm32mp2xxxx.h))
  * @retval status: - 0  Interrupt status is not pending.
  *                 - 1  Interrupt status is pending.
  */
uint32_t HAL_NVIC_GetActive(IRQn_Type IRQn)
{
  /* Check input parameter */
  assert_param(IS_NVIC_IRQN_TYPE(IRQn));

